app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 303], ["updated_at", "2021-03-25 14:40:43.266255"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by(id: params[:id])
    @school_class.update(school_class_params(:title, :room_number))