app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Amanda"], ["last_name", "Baydar"], ["created_at", "2021-03-25 14:50:34.931045"], ["updated_at", "2021-03-25 14:50:34.931045"]]
---
  def create
    @student = Student.new(students_params(:first_name, :last_name))
    @student.save